//=====================================================
// Напишіть цикл for, який виконуватиме ітерацію від 0 до 15. Для кожної ітерації він перевірятиме, парне чи непарне поточне число, і виводитиме повідомлення на екран.

// for (let i = 0; i < 15; i += 1){
//     if (i % 2 === 0) {
//         console.log(i, "парне");
//     }
//     else{
//         console.log(i, "непарне");
//     }
// }

// for (let i = 0; i <= 15; i += 1){
//     switch (i % 2) {
//         case 0:
//             console.log(i, "парне");
//             break;
//         default:
//            console.log(i, "непарне");
//     }
// }

// for (let i = 0; i < 15; i += 1){
//     i % 2 === 0 ? console.log(i, "парне"): console.log(i, "непарне");
// }


// for (let i = 0; i < 15; i += 1){
//     console.log(i, i % 2 === 0 ? "парне": "непарне");
// }

//=====================================================

